Repository: SangulugariMadhuGoud/Gatepass-Demo
Catalog: Gatepass/gatepass/locale/*/LC_MESSAGES/django.po
Languages: hi, te

source: Hostel Gatepass System
hi: हॉस्टल गेटपास सिस्टम
te: హాస్టల్ గేట్‌పాస్ సిస్టమ్

source: Dashboard
hi: डैशबोर्ड
te: డాష్‌బోర్డ్

source: Request Gatepass
hi: गेटपास अनुरोध
te: గేట్‌పాస్ అభ్యర్థన

source: Notifications
hi: सूचनाएं
te: నోటిఫికేషన్లు

source: View all
hi: सभी देखें
te: అన్నీ చూడండి

source: No new notifications
hi: कोई नई सूचना नहीं
te: కొత్త నోటిఫికేషన్లు లేవు

source: Logout
hi: लॉग आउट
te: లాగ్ అవుట్

source: Login
hi: लॉग इन
te: లాగిన్

source: English
hi: अंग्रेज़ी
te: ఇంగ్లీష్

source: Improved UI • Faster workflows • Accessible by design
hi: बेहतर UI • तेज़ वर्कफ़्लो • डिज़ाइन के अनुसार सुलभ
te: మెరుగైన UI • వేగవంతమైన వర్క్‌ఫ్లోలు • డిజైన్ ద్వారా యాక్సెసిబుల్

source: Home
hi: होम
te: హోమ్

source: Fast, transparent and secure gatepass workflow for hostels.
hi: हॉस्टल के लिए तेज़, पारदर्शी और सुरक्षित गेटपास वर्कफ़्लो।
te: హాస్టల్‌లకు వేగవంతమైన, పారదర్శకమైన మరియు సురక్షిత గేట్‌పాస్ వర్క్‌ఫ్లో.

source: Explore roles
hi: भूमिकाएं देखें
te: పాత్రలను అన్వేషించండి

source: Student
hi: छात्र
te: విద్యార్థి

source: Register and request gatepass for outings.
hi: आउटिंग के लिए पंजीकरण करें और गेटपास अनुरोध करें।
te: బయటకు వెళ్లడానికి నమోదు చేసుకోండి మరియు గేట్‌పాస్ అభ్యర్థించండి.

source: Register
hi: पंजीकरण
te: నమోదు

source: Warden
hi: वार्डन
te: వార్డన్

source: Approve gatepass requests from students.
hi: छात्रों से गेटपास अनुरोधों को स्वीकृति दें।
te: విద్యార్థుల నుండి గేట్‌పాస్ అభ్యర్థనలను ఆమోదించండి.

source: Security
hi: सुरक्षा
te: భద్రత

source: Manage gate access and final approvals.
hi: गेट एक्सेस और अंतिम स्वीकृति प्रबंधित करें।
te: గేట్ యాక్సెస్ మరియు చివరి ఆమోదాలను నిర్వహించండి.

source: Super Admin
hi: सुपर एडमिन
te: సూపర్ అడ్మిన్

source: Manage all users and system settings.
hi: सभी उपयोगकर्ताओं और सिस्टम सेटिंग्स को प्रबंधित करें।
te: అన్ని వినియోగదారులు మరియు సిస్టమ్ సెట్టింగ్‌లను నిర్వహించండి.

source: Admin Login
hi: एडमिन लॉगिन
te: అడ్మిన్ లాగిన్

source: How It Works
hi: यह कैसे काम करता है
te: ఇది ఎలా పనిచేస్తుంది

source: 1. Student Registration
hi: 1. छात्र पंजीकरण
te: 1. విద్యార్థి నమోదు

source: Students register with their details and wait for admin approval.
hi: छात्र अपने विवरण के साथ पंजीकरण करते हैं और एडमिन स्वीकृति की प्रतीक्षा करते हैं।
te: విద్యార్థులు తమ వివరాలతో నమోదు చేసుకొని అడ్మిన్ ఆమోదానికి వేచి ఉంటారు.

source: Students submit gatepass requests with outing details.
hi: छात्र आउटिंग विवरण के साथ गेटपास अनुरोध जमा करते हैं।
te: విద్యార్థులు బయట వివరాలతో గేట్‌పాస్ అభ్యర్థనలను సమర్పిస్తారు.

source: 3. Approval Process
hi: 3. स्वीकृति प्रक्रिया
te: 3. ఆమోద ప్రక్రియ

source: Warden and Security approve requests in sequence.
hi: वार्डन और सुरक्षा अनुरोधों को क्रम में स्वीकृति देते हैं।
te: వార్డన్ మరియు భద్రత వరుసగా అభ్యర్థనలను ఆమోదిస్తారు.

source: Security Dashboard
hi: सुरक्षा डैशबोर्ड
te: భద్రత డాష్‌బోర్డ్

source: Approve student exits and record their returns.
hi: छात्र निकासी को स्वीकृति दें और उनके वापसी रिकॉर्ड करें।
te: విద్యార్థి నిష్క్రమణలను ఆమోదించండి మరియు వారి తిరిగి రాకలను రికార్డ్ చేయండి.

source: Waiting for Exit
hi: निकासी की प्रतीक्षा
te: నిష్క్రమణకు వేచి ఉంది

source: Students Out
hi: छात्र बाहर
te: విద్యార్థులు బయట

source: Returned Today
hi: आज वापस आए
te: ఈ రోజు తిరిగి వచ్చారు

source: Your Shift
hi: आपकी शिफ्ट
te: మీ షిఫ్ట్

source: Search Students
hi: छात्र खोजें
te: విద్యార్థులను శోధించండి

source: Search by student name, hall ticket, room number, or purpose...
hi: छात्र नाम, हॉल टिकट, कमरा नंबर या उद्देश्य से खोजें...
te: విద్యార్థి పేరు, హాల్ టికెట్, గది నంబర్ లేదా ఉద్దేశం ద్వారా శోధించండి...

source: Search
hi: खोजें
te: శోధించండి

source: Clear
hi: साफ़ करें
te: క్లియర్

source: All Records Displayed:
hi: सभी रिकॉर्ड प्रदर्शित:
te: అన్ని రికార్డ్‌లు ప్రదర్శించబడ్డాయి:

source: All student exit and return records are shown below (no limit). Use search above to filter if needed.
hi: सभी छात्र निकासी और वापसी रिकॉर्ड नीचे दिखाए गए हैं (कोई सीमा नहीं)। फ़िल्टर करने के लिए ऊपर खोज का उपयोग करें।
te: అన్ని విద్యార్థి నిష్క్రమణ మరియు తిరిగి రాక రికార్డ్‌లు క్రింద చూపించబడ్డాయి (పరిమితి లేదు). అవసరమైతే ఫిల్టర్ చేయడానికి పైన శోధనను ఉపయోగించండి.
